# todo 1. 创建和加载数据库
import warnings
warnings.filterwarnings("ignore", message="pkg_resources is deprecated")
from pymilvus import MilvusClient, DataType, AnnSearchRequest, WeightedRanker


def operate_db():
    client = MilvusClient("http://localhost:19530")

    # 查看客户端有哪些集合
    databases = client.list_databases()
    print(databases)
    # 判断一个库是否存在
    if 'nj_milvus_demo' not in databases:
        print("nj_milvus_demo not in databases")
        client.create_database("nj_milvus_demo")
        print("nj_milvus_demo created")
        client.using_database("nj_milvus_demo")
        # print("using database nj_milvus_demo")
    else:
        print("nj_milvus_demo already exists")
        # print("using database nj_milvus_demo")

        client.using_database("nj_milvus_demo")
    return client
# todo 2. 创建集合
def create_collection(m_cli, collection_name):
    # 定义几个的Schema(相当于表结构)
    # 参1:是否自增主键，参2:是否启用动态字段
    schema = m_cli.create_schema(
        auto_id=False,
        enable_dynamic_field=True,

    )
    # 向schema中添加字段
    schema.add_field(
        field_name='id',
        datatype=DataType.INT64,
        is_primary=True,
        description='id'
    )
    schema.add_field(
        field_name='vector',
        datatype=DataType.FLOAT_VECTOR,
        dim=128,
        description='vector'
    )

    m_cli.create_collection(collection_name=collection_name, schema=schema)

# todo 3. 索引操作
def operate_index(m_cli):
    #场景1: 为向量字段添加索引
    # 注意点:后续所有的索引操作都基于这个prepare_params
    prepare_params = m_cli.prepare_index_params()

    # 给向量字段添加索引
    prepare_params.add_index(
        field_name='vector',
        index_name='vector_index',
        index_type='',
        # params={"nlist": 128},
        metric_type='COSINE'
    )
    # m_cli.create_index(collection_name='demo', index_params=prepare_params)
    # 场景2: 查看索引信息

    indexes = m_cli.list_indexes(collection_name='demo')
    print(indexes)
    # 查看索引详细信息
    index_detail = m_cli.describe_index(collection_name='demo',index_name='vector_index')
    print(index_detail)

    #场景3: 集合的加载和释放

    #  1. 查看集合的加载状态
    load_status = m_cli.get_load_state(collection_name='demo')
    print(load_status)
    # 2. 加载集合
    m_cli.load_collection(collection_name='demo')
    # 3. 释放集合
    m_cli.release_collection(collection_name='demo')
    # #场景4: 删除索引
    # m_cli.drop_index(collection_name='demo', index_name='vector_index')
    # print("索引已删除")
    #场景5: 为标量字段添加索引

# todo 4. 数据操作
def operate_data(m_cli):
    # m_cli.create_collection(collection_name='demo_v3',dimension=5,metric_type='L2')
    # 向集合中添加数据
    data = [
        {"id": 0, "vector": [0.3580376395471989, -0.6023495712049978, 0.18414012509913835, -0.26286205330961354,
                             0.9029438446296592], "color": "pink_8682"},
        {"id": 1, "vector": [0.19886812562848388, 0.06023560599112088, 0.6976963061752597, 0.2614474506242501,
                             0.838729485096104], "color": "red_7025"},
        {"id": 2, "vector": [0.43742130801983836, -0.5597502546264526, 0.6457887650909682, 0.7894058910881185,
                             0.20785793220625592], "color": "orange_6781"},
        {"id": 3, "vector": [0.3172005263489739, 0.9719044792798428, -0.36981146090600725, -0.4860894583077995,
                             0.95791889146345], "color": "pink_9298"},
        {"id": 4, "vector": [0.4452349528804562, -0.8757026943054742, 0.8220779437047674, 0.46406290649483184,
                             0.30337481143159106], "color": "red_4794"},
        {"id": 5, "vector": [0.985825131989184, -0.8144651566660419, 0.6299267002202009, 0.1206906911183383,
                             -0.1446277761879955], "color": "yellow_4222"},
        {"id": 6, "vector": [0.8371977790571115, -0.015764369584852833, -0.31062937026679327, -0.562666951622192,
                             -0.8984947637863987], "color": "red_9392"},
        {"id": 7, "vector": [-0.33445148015177995, -0.2567135004164067, 0.8987539745369246, 0.9402995886420709,
                             0.5378064918413052], "color": "grey_8510"},
        {"id": 8, "vector": [0.39524717779832685, 0.4000257286739164, -0.5890507376891594, -0.8650502298996872,
                             -0.6140360785406336], "color": "white_9381"},
        {"id": 9, "vector": [0.5718280481994695, 0.24070317428066512, -0.3737913482606834, -0.06726932177492717,
                             -0.6980531615588608], "color": "purple_4976"}
    ]
    # 插入数据
    # insert() 方法可能会有重复数据，需要使用 upsert() 方法
    m_cli.upsert(collection_name='demo_v3', data=data)
    # m_cli.insert(collection_name='demo_v3', data=data)
    # 在集合中创建分区
    m_cli.create_partition(collection_name='demo_v3', partition_name='partition_1')
    # 1. 准备要往分区中添加的数据
    data = [
        {"id": 10, "vector": [-0.5570353903748935, -0.8997887893201304, -0.7123782431855732, -0.6298990746450119,
                              0.6699215060604258], "color": "red_1202"},
        {"id": 11, "vector": [0.6319019033373907, 0.6821488267878275, 0.8552303045704168, 0.36929791364943054,
                              -0.14152860714878068], "color": "blue_4150"},
        {"id": 12, "vector": [0.9483947484855766, -0.32294203351925344, 0.9759290319978025, 0.8262982148666174,
                              -0.8351194181285713], "color": "orange_4590"},
        {"id": 13, "vector": [-0.5449109892498731, 0.043511240563786524, -0.25105249484790804, -0.012030655265886425,
                              -0.0010987671273892108], "color": "pink_9619"},
        {"id": 14, "vector": [0.6603339372951424, -0.10866551787442225, -0.9435597754324891, 0.8230244263466688,
                              -0.7986720938400362], "color": "orange_4863"},
        {"id": 15, "vector": [-0.8825129181091456, -0.9204557711667729, -0.935350065513425, 0.5484069690287079,
                              0.24448151140671204], "color": "orange_7984"},
        {"id": 16, "vector": [0.6285586391568163, 0.5389064528263487, -0.3163366239905099, 0.22036279378888013,
                              0.15077052220816167], "color": "blue_9010"},
        {"id": 17, "vector": [-0.20151825016059233, -0.905239387635804, 0.6749305353372479, -0.7324272081377843,
                              -0.33007998971889263], "color": "blue_4521"},
        {"id": 18, "vector": [0.2432286610792349, 0.01785636564206139, -0.651356982731391, -0.35848148851027895,
                              -0.7387383128324057], "color": "orange_2529"},
        {"id": 19, "vector": [0.055512329053363674, 0.7100266349039421, 0.4956956543575197, 0.24541352586717702,
                              0.4209030729923515], "color": "red_9437"}
    ]

    # 2. 往分区中添加数据 -> upsert
    # 参1: 目标集合名称,   参2: 要添加的数据,   参3: 目标分区名称
    m_cli.upsert(collection_name='demo_v3', data=data, partition_name='partition_1')

    # 3. 额外动作, 把上述数据也添加到默认分区中
    m_cli.upsert(collection_name='demo_v3', data=data)

    # 4.删除数据  如不指定分区 默认在所有分区删除

    m_cli.delete(collection_name='demo_v3', ids=[5,13,14])

    # 指定分区
    m_cli.delete(collection_name='demo_v3', ids=[5,16,18], partition_name='partition_1')

    pass

# todo 5. 数据查询
def query_entity(m_cli):

#--------------------------------- 场景1: 单一向量查询(根据 单个向量 找相似结果 )
    # 1.调用Search()方法执行单一向量查询
    res1 = m_cli.search(
        collection_name='demo_v3',
        data=[[0.3580376395471989, -0.6023495712049978, 0.18414012509913835, -0.26286205330961354,
               0.9029438446296592]],
        # param={"nprobe": 10},
        limit=2,
        output_fields=["color",'vector'],
        search_params={"metric_type": 'L2'}
    )
    # print(f"查询结果: {res1}")

#--------------------------------- 场景2: 批量向量查询(根据 多个向量 同时 找相似结果 )
    res2 = m_cli.search(
        collection_name='demo_v3',
        data=[[0.35803765058517456,-0.602349579334259,0.1841401308774948,-0.26286205649375916,0.9029438495635986],[0.31720051169395447,0.971904456615448,-0.369811475276947,-0.48608946800231934,0.9579188823699951]],
        limit=2,
        output_fields=["color",'vector'],
        search_params={"metric_type": 'L2'}

    )
    # print(f"查询结果: {res2}")
    # print(type(res2))

#--------------------------------- 场景3: 分区搜索(仅在指定的分区中搜索)
#--------------------------------- 场景4: 指定输出字段搜索(仅返回需要的字段, 减少数据量)
#--------------------------------- 场景5: 带过滤条件的搜索(先过滤数据再找相似结果)
#--------------------------------- 场景6: 范围搜索(仅返回相似度在指定范围内的结果)

    res5 = m_cli.search(
        collection_name='demo_v3',
        data=[[0.3580376395471989, -0.6023495712049978, 0.18414012509913835, -0.26286205330961354,
               0.9029438446296592]],
        limit=2,
        output_fields=["color",'vector'],
        search_params={
            "metric_type": 'L2',
            'params': {
                "radius": 1.0,        # 距离上界：返回 L2 距离 <= 1.0 的结果（距离越小越相似）
                "range_filter": 0.6  # 距离下界：返回 L2 距离 >= 0.6 的结果（用来排除过于相似的）
            }  # 最终返回距离在 (0.6, 1.0) 之间的结果，必须满足 range_filter < radius
        }
    )
    print(res5)

# todo 6. 复杂查询(创建集合,插入数据,创建索引)
def complex_query_add_data(m_cli):
    schema = m_cli.create_schema(
        enable_dynamic_field=False, # 不允许动态添加字段
    )
    schema.add_field(
        field_name='film_id',
        datatype=DataType.INT64,
        is_primary=True,
        description='film_id'
    )
    schema.add_field(
        field_name='film_vector',
        datatype=DataType.FLOAT_VECTOR,
        # is_primary=True,
        description='film_vector',
        dim=128,
    )
    schema.add_field(
        field_name='poster_vector',
        datatype=DataType.FLOAT_VECTOR,
        # is_primary=True,
        description='poster_vector',
        dim=128,
    )
    # 初始化索引对象
    index_params = m_cli.prepare_index_params()
    index_params.add_index(
        field_name='film_vector',
        index_name='film_index',
        index_type='IVF_FLAT',
        params={"nlist": 128},
        metric_type='L2'
    )
    index_params.add_index(
        field_name='poster_vector',
        index_name='poster_index',
        index_type='IVF_FLAT',
        params={"nlist": 128},
        metric_type='COSINE'
    )
    # m_cli.create_collection(collection_name='demo_v4', schema=schema, index_params=index_params)
    # print('成功创建集合demo_v4')
    # 创建数据
    import random
    entities = []
    for _ in range(1000):
        film_id = random.randint(1, 1000)
        film_vector = [random.random() for _ in range(128)]
        poster_vector = [random.random() for _ in range(128)]
        # 组合数据
        entities.append({
            'film_id': film_id,
            'film_vector': film_vector,
            'poster_vector': poster_vector
        })
    m_cli.upsert(collection_name='demo_v4', data=entities)
    print(f"成功插入 {len(entities)} 条数据")

# todo 7. 复杂查询
def complex_query(m_cli):
    # -----------------第一路查询
    # 定义查询向量
    query_film_vector = [[0.30393749475479126,0.6975749731063843,0.7485753893852234,0.825515866279602,0.3569832146167755,0.43457990884780884,0.26799413561820984,0.3888985812664032,0.7627673745155334,0.9975820779800415,0.5802128911018372,0.6568026542663574,0.48454371094703674,0.028630398213863373,0.3266058564186096,0.11153368651866913,0.7492319345474243,0.1428052932024002,0.08082685619592667,0.7946297526359558,0.0366346575319767,0.011630644090473652,0.0109516317024827,0.600257933139801,0.7535839080810547,0.401398241519928,0.07562880963087082,0.6791166067123413,0.40542328357696533,0.18554732203483582,0.4531702399253845,0.21390201151371002,0.8549721240997314,0.45084109902381897,0.5761324167251587,0.3043915033340454,0.9710524678230286,0.7173601388931274,0.32061174511909485,0.7979846596717834,0.7792795300483704,0.9513678550720215,0.22861482203006744,0.9214544296264648,0.3285965323448181,0.6673387885093689,0.09951528161764145,0.32513588666915894,0.6441174745559692,0.8365297317504883,0.4932033121585846,0.7072528600692749,0.8307535648345947,0.544501006603241,0.7634774446487427,0.230084627866745,0.6929352879524231,0.49664410948753357,0.21779535710811615,0.9333257079124451,0.3695937395095825,0.5524588227272034,0.25589826703071594,0.8529903888702393,0.2134283035993576,0.9560543298721313,0.15491916239261627,0.31235983967781067,0.4177311658859253,0.8222674131393433,0.3652973473072052,0.26941514015197754,0.03988179564476013,0.3083249032497406,0.8601013422012329,0.5978559255599976,0.6058747172355652,0.6856029629707336,0.1176067665219307,0.6161767244338989,0.4115094542503357,0.6318813562393188,0.7696336507797241,0.8562578558921814,0.682813823223114,0.6709653735160828,0.2277994155883789,0.447334885597229,0.45588502287864685,0.2562476098537445,0.19966013729572296,0.2621328830718994,0.2979578673839569,0.5053701996803284,0.8555634617805481,0.804751992225647,0.3620259761810303,0.41828662157058716,0.6949557065963745,0.2733915448188782,0.12353015691041946,0.38167643547058105,0.5157719850540161,0.0893624946475029,0.8845235705375671,0.9538534879684448,0.11663433909416199,0.8087267875671387,0.7138447761535645,0.5046513080596924,0.3155612349510193,0.8033131957054138,0.8031657934188843,0.691862165927887,0.37618812918663025,0.6855807304382324,0.7998923659324646,0.7993634343147278,0.39302393794059753,0.6502167582511902,0.9103966355323792,0.1638011485338211,0.5630552172660828,0.2535513639450073,0.2001744508743286,0.23966850340366364,0.2149704545736313,0.4196527600288391]]

    # 配置搜索参数
    search_params_one={
        "data": query_film_vector,
        'anns_field':'film_vector',
        'param':{
            'metric_type': 'L2',
            'nprobe': 10
        },
        "limit": 10,
    }
    # 创建搜索请求对象
    res1 = AnnSearchRequest(**search_params_one)

    # -----------------第二路查询
    # 定义查询向量
    query_poster_vector = [[0.5232530236244202,0.7128662467002869,0.9690314531326294,0.7583580017089844,0.34235984086990356,0.5629433989524841,0.1575930118560791,0.8196883797645569,0.08622937649488449,0.339044451713562,0.843208372592926,0.9430615305900574,0.25496095418930054,0.9901571273803711,0.9084823131561279,0.4251629710197449,0.8410562872886658,0.4476555287837982,0.2316407412290573,0.2247423231601715,0.158428356051445,0.1964363157749176,0.5573817491531372,0.7065669894218445,0.15855816006660461,0.4971367418766022,0.9995121359825134,0.24301405251026154,0.9119023084640503,0.8024482131004333,0.9273547530174255,0.3223831355571747,0.49273043870925903,0.7468090057373047,0.7743396759033203,0.9605914354324341,0.13799935579299927,0.21590623259544373,0.7048938274383545,0.47282394766807556,0.20123623311519623,0.4513503313064575,0.5354229807853699,0.5320354104042053,0.2398555725812912,0.01944311335682869,0.5595736503601074,0.15046890079975128,0.27444887161254883,0.11437827348709106,0.8260169625282288,0.4119792878627777,0.6823534369468689,0.1066647469997406,0.06749440729618073,0.37694790959358215,0.5489645600318909,0.2676670551300049,0.9512365460395813,0.9124374985694885,0.4667254686355591,0.9505181312561035,0.16929037868976593,0.8367520570755005,0.8089200258255005,0.7327535152435303,0.9015761017799377,0.7372998595237732,0.977780282497406,0.9914597868919373,0.6871533989906311,0.6898453235626221,0.3005336821079254,0.22087988257408142,0.06754957139492035,0.8166609406471252,0.7583194375038147,0.5084062218666077,0.807346522808075,0.10888315737247467,0.4471134841442108,0.13952530920505524,0.7351089119911194,0.471475750207901,0.5725980401039124,0.9830649495124817,0.9549692273139954,0.10810575634241104,0.1509537547826767,0.39859774708747864,0.7346794009208679,0.010199337266385555,0.8521027565002441,0.39722734689712524,0.825019121170044,0.5864133834838867,0.7674890160560608,0.13233144581317902,0.5478706359863281,0.8686849474906921,0.41670840978622437,0.2536020576953888,0.3001784682273865,0.7733570337295532,0.9565501809120178,0.2244577407836914,0.5441190600395203,0.13637343049049377,0.4331132471561432,0.06664780527353287,0.7399815320968628,0.738605797290802,0.382062703371048,0.5231040716171265,0.13496771454811096,0.17967180907726288,0.7732439041137695,0.8775085210800171,0.09039416164159775,0.9563866853713989,0.5197005867958069,0.6164554357528687,0.42237454652786255,0.5917976498603821,0.6191790699958801,0.2310810685157776,0.48967859148979187,0.8609028458595276]]

# 配置搜索参数
    search_params_two={
        "data": query_poster_vector,
        'anns_field':'poster_vector',
        'param':{
            'metric_type': 'COSINE',
            'nprobe': 10
        },
        "limit": 10,
    }
    # 创建搜索请求对象
    res2 = AnnSearchRequest(**search_params_two)
    reqs=[res1, res2]
    rerank = WeightedRanker(0.5,0.5)
    outputs = m_cli.hybrid_search(
        collection_name='demo_v4',
        reqs=reqs,
        ranker=rerank,
        limit=2,
        output_fields=['film_id']
    )
    for hits in outputs:
        print('查询结果')
        for hit in hits:
            print(hit)

if __name__ == '__main__':
    cli = operate_db()
    # create_collection(cli,collection_name='demo')
    # operate_index(cli)
    # operate_data(cli)
    # query_entity(cli)
    # complex_query_add_data(cli)
    complex_query(cli)